{
  "title": {
    "en": "Guide",
    "zh-Hant": "使用指南",
    "zh-Hans": "使用指南",
    "es": "Guía",
    "fr": "Guide",
    "de": "Anleitung",
    "it": "Guida",
    "ja": "ガイド",
    "ko": "가이드",
    "pt-PT": "Guia",
    "nl": "Handleiding",
    "pl": "Przewodnik",
    "ru": "Руководство",
    "tr": "Kılavuz",
    "ar": "دليل",
    "cs": "Průvodce",
    "da": "Vejledning",
    "fi": "Opas",
    "el": "Οδηγός",
    "he": "מדריך",
    "hi": "मार्गदर्शिका",
    "hu": "Útmutató",
    "id": "Panduan",
    "nb": "Veiledning",
    "ro": "Ghid",
    "sk": "Príručka",
    "sv": "Guide",
    "th": "คู่มือ",
    "uk": "Посібник",
    "vi": "Hướng dẫn"
  },
  "tldr": {
    "en": "Sign in to your Octopus Energy account, locate your API Key and Account Number in the 'API access' section and your user details, then manually copy them into the relevant fields. You may need to switch between windows to gather all the required information.",
    "zh-Hant": "請先登入您的 Octopus Energy 帳戶，於「API 存取」區段及用戶詳細資料中尋找您的 API 金鑰和帳戶號碼，然後手動將它們複製到對應的欄位。您可能需要在視窗之間切換，以取得所有所需資訊。",
    "zh-Hans": "请先登录您的 Octopus Energy 账户，在“API 访问”和用户详细信息中找到您的 API 密钥和账户号，然后将它们手动复制到相应的字段。您可能需要在不同的窗口之间切换，以收集所有必需的信息。",
    "es": "Inicie sesión en su cuenta de Octopus Energy, busque su Clave API y su Número de Cuenta en la sección 'acceso API' y en los detalles de usuario, luego cópielos manualmente en los campos correspondientes. Es posible que deba cambiar de ventana para reunir toda la información necesaria.",
    "fr": "Connectez-vous à votre compte Octopus Energy, repérez votre Clé API et votre Numéro de Compte dans la section « accès API » et dans les détails de votre profil, puis copiez-les manuellement dans les champs prévus. Vous devrez peut-être basculer entre plusieurs fenêtres pour rassembler toutes les informations requises.",
    "de": "Melden Sie sich bei Ihrem Octopus Energy-Konto an, suchen Sie Ihren API-Schlüssel und Ihre Kontonummer im Bereich „API-Zugriff“ sowie in Ihren Benutzerdetails, und kopieren Sie sie manuell in die entsprechenden Felder. Möglicherweise müssen Sie zwischen Fenstern wechseln, um alle benötigten Informationen zu sammeln.",
    "it": "Acceda al suo account Octopus Energy, individui la sua Chiave API e il suo Numero di Account nella sezione 'accesso API' e nei dettagli dell'utente, quindi copi manualmente queste informazioni nei campi corrispondenti. Potrebbe essere necessario passare da una finestra all'altra per raccogliere tutte le informazioni richieste.",
    "ja": "Octopus Energyアカウントにサインインし、「APIアクセス」セクションとユーザー詳細でAPIキーとアカウント番号を見つけてから、それらを対応するフィールドに手動でコピーしてください。必要な情報をすべて取得するには、ウィンドウを切り替える必要がある場合があります。",
    "ko": "Octopus Energy 계정에 로그인한 뒤, 'API 액세스' 영역과 사용자 정보에서 API 키와 계정 번호를 찾고, 이를 수동으로 해당 필드에 복사하세요. 필요한 정보를 모두 모으기 위해 창 간 전환이 필요할 수 있습니다.",
    "pt-PT": "Inicie sessão na sua conta Octopus Energy, localize a sua Chave API e o seu Número de Conta na secção 'acesso API' e nos detalhes do utilizador, e copie-os manualmente para os campos relevantes. Poderá ser necessário alternar entre janelas para recolher todas as informações necessárias.",
    "nl": "Log in op uw Octopus Energy-account, zoek uw API-sleutel en accountnummer in het gedeelte ‘API-toegangs’ en in uw gebruikersgegevens, en kopieer deze handmatig naar de bijbehorende velden. Het kan nodig zijn om tussen vensters te schakelen om alle vereiste informatie te verzamelen.",
    "pl": "Zaloguj się do swojego konta Octopus Energy, zlokalizuj Klucz API i Numer Konta w sekcji „dostęp API” oraz w szczegółach użytkownika, a następnie ręcznie skopiuj je do odpowiednich pól. Może być konieczne przełączanie się między oknami, aby zebrać wszystkie potrzebne informacje.",
    "ru": "Войдите в свою учетную запись Octopus Energy, найдите API-ключ и номер счета в разделе «доступ к API» и в данных пользователя, затем вручную скопируйте их в соответствующие поля. Возможно, вам придется переключаться между окнами, чтобы собрать всю необходимую информацию.",
    "tr": "Octopus Energy hesabınıza giriş yapın, 'API erişimi' bölümünde ve kullanıcı bilgilerinde API Anahtarınızı ve Hesap Numaranızı bulun, ardından bunları ilgili alanlara elle kopyalayın. Gerekli tüm bilgileri toplamak için pencereler arasında geçiş yapmanız gerekebilir.",
    "ar": "سجّل الدخول إلى حساب Octopus Energy الخاص بك، وابحث عن مفتاح API ورقم الحساب في قسم «الوصول إلى API» وفي تفاصيل المستخدم، ثم انسخهما يدويًا إلى الحقول ذات الصلة. قد تحتاج إلى التبديل بين النوافذ لجمع كل المعلومات المطلوبة.",
    "cs": "Přihlaste se ke svému účtu Octopus Energy, vyhledejte svůj API klíč a číslo účtu v sekci „přístup k API“ a v uživatelských detailech, poté je ručně zkopírujte do příslušných polí. Může být nutné přepínat mezi okny, abyste shromáždili všechny potřebné informace.",
    "da": "Log ind på din Octopus Energy-konto, find din API-nøgle og dit kontonummer i afsnittet 'API-adgang' og i dine brugeroplysninger, og kopier dem manuelt til de relevante felter. Du kan få brug for at skifte mellem vinduer for at indsamle alle nødvendige oplysninger.",
    "fi": "Kirjaudu sisään Octopus Energy -tilillesi, etsi API-avaimesi ja tilinumerosi kohdasta 'API-käyttöoikeus' ja käyttäjätiedoista, ja kopioi tiedot käsin annettuihin kenttiin. Saatat joutua vaihtamaan ikkunoiden välillä kerätäksesi kaikki tarvittavat tiedot.",
    "el": "Συνδεθείτε στον λογαριασμό σας στο Octopus Energy, εντοπίστε το Κλειδί API και τον Αριθμό Λογαριασμού σας στην ενότητα «πρόσβαση API» και στις πληροφορίες χρήστη, έπειτα αντιγράψτε τα με μη αυτόματο τρόπο στα κατάλληλα πεδία. Ίσως χρειαστεί να εναλλάσσεστε μεταξύ παραθύρων για να συγκεντρώσετε όλες τις απαιτούμενες πληροφορίες.",
    "he": "היכנס לחשבון Octopus Energy שלך, מצא את מפתח ה-API ומספר החשבון באזור 'גישה ל-API' ובפרטי המשתמש, והעתק אותם ידנית לשדות המתאימים. ייתכן שתצטרך לעבור בין חלונות כדי לאסוף את כל המידע הדרוש.",
    "hi": "अपने Octopus Energy खाते में साइन इन करें, ‘API एक्सेस’ सेक्शन और उपयोगकर्ता विवरण में अपनी API कुंजी और खाता संख्या ढूंढें, फिर उन्हें मैन्युअल रूप से संबंधित फ़ील्ड में कॉपी करें। सभी आवश्यक जानकारी एकत्र करने के लिए आपको विभिन्न विंडो के बीच स्विच करना पड़ सकता है।",
    "hu": "Jelentkezzen be Octopus Energy-fiókjába, keresse meg az API kulcsot és a számlaszámot az „API hozzáférés” részben, valamint a felhasználói adatoknál, majd kézzel másolja ezeket a megfelelő mezőkbe. Lehetséges, hogy ablakok között kell váltania az összes szükséges információ összegyűjtéséhez.",
    "id": "Masuk ke akun Octopus Energy Anda, temukan Kunci API dan Nomor Akun di bagian 'akses API' dan detail pengguna, lalu salin secara manual ke kolom yang sesuai. Anda mungkin perlu beralih antara jendela untuk mengumpulkan semua informasi yang diperlukan.",
    "nb": "Logg inn på Octopus Energy-kontoen din, finn API-nøkkelen og kontonummeret ditt i «API-tilgang»-delen og brukerdetaljene, og kopier dem manuelt inn i de aktuelle feltene. Du må kanskje bytte mellom vinduer for å samle all nødvendig informasjon.",
    "ro": "Conectați-vă la contul dvs. Octopus Energy, localizați Cheia API și Numărul de Cont în secțiunea «acces API» și în detaliile de utilizator, apoi copiați-le manual în câmpurile corespunzătoare. Este posibil să fie nevoie să comutați între ferestre pentru a aduna toate informațiile necesare.",
    "sk": "Prihláste sa do svojho účtu Octopus Energy, nájdite svoj API kľúč a číslo účtu v časti „prístup k API“ a detailoch používateľa a potom ich ručne skopírujte do príslušných polí. Môže byť potrebné prepínať medzi oknami, aby ste zhromaždili všetky potrebné informácie.",
    "sv": "Logga in på ditt Octopus Energy-konto, hitta din API-nyckel och kontonummer i avsnittet 'API-åtkomst' och dina användaruppgifter, och kopiera dem manuellt till de angivna fälten. Du kan behöva växla mellan fönster för att samla all nödvändig information.",
    "th": "ลงชื่อเข้าใช้บัญชี Octopus Energy ของคุณ ค้นหา API Key และหมายเลขบัญชีในส่วน 'API Access' และรายละเอียดผู้ใช้ จากนั้นคัดลอกข้อมูลเหล่านี้ไปยังฟิลด์ที่เกี่ยวข้องด้วยตนเอง คุณอาจจำเป็นต้องสลับหน้าต่างเพื่อรวบรวมข้อมูลทั้งหมดที่ต้องใช้",
    "uk": "Увійдіть до свого облікового запису Octopus Energy, знайдіть свій API-ключ і номер рахунку в розділі «доступ до API» та у відомостях користувача, а потім вручну скопіюйте їх у відповідні поля. Можливо, доведеться перемикатися між вікнами, щоб зібрати всю необхідну інформацію.",
    "vi": "Đăng nhập vào tài khoản Octopus Energy của bạn, tìm Khóa API và Số Tài khoản ở phần 'truy cập API' cũng như chi tiết người dùng, rồi sao chép chúng theo cách thủ công vào các trường tương ứng. Bạn có thể cần chuyển đổi giữa các cửa sổ để thu thập đầy đủ thông tin cần thiết."
  },
  "heading": {
    "en": "How to Find Your Details",
    "zh-Hant": "如何查閱您的詳細資料",
    "zh-Hans": "如何查阅您的详细信息",
    "es": "Cómo localizar sus datos",
    "fr": "Comment trouver vos informations",
    "de": "So finden Sie Ihre Angaben",
    "it": "Come trovare i tuoi dati",
    "ja": "詳細情報の見つけ方",
    "ko": "내 정보 확인 방법",
    "pt-PT": "Como localizar os seus detalhes",
    "nl": "Hoe u uw gegevens kunt vinden",
    "pl": "Jak znaleźć swoje dane",
    "ru": "Как найти ваши данные",
    "tr": "Bilgilerinizi nasıl bulabilirsiniz",
    "ar": "كيفية العثور على تفاصيلك",
    "cs": "Jak najít své údaje",
    "da": "Sådan finder du dine oplysninger",
    "fi": "Kuinka löytää omat tietosi",
    "el": "Πώς να βρείτε τα στοιχεία σας",
    "he": "כיצד לאתר את הפרטים שלך",
    "hi": "अपनी जानकारी कैसे ढूंढें",
    "hu": "Hogyan találja meg adatait",
    "id": "Cara menemukan detail Anda",
    "nb": "Slik finner du detaljene dine",
    "ro": "Cum să vă găsiți detaliile",
    "sk": "Ako nájsť vaše údaje",
    "sv": "Hur du hittar dina uppgifter",
    "th": "วิธีค้นหาข้อมูลของคุณ",
    "uk": "Як знайти ваші дані",
    "vi": "Cách tìm thông tin của bạn"
  },
  "steps": {
    "en": [
      "Sign in to your Octopus Energy account using the links provided.",
      "Locate your API Key and Account Number in the 'API access' section once you've logged in.",
      "Copy these details into the relevant fields within Octomiser.",
      "You may need to switch between windows or tabs to gather all the necessary information.",
      "We do not automatically retrieve these details from your Octopus Energy account, as it would breach their terms of service."
    ],
    "zh-Hant": [
      "使用上方提供的連結登入您的 Octopus Energy 帳戶。",
      "登入後，前往「API 存取」區段查看您的 API 金鑰和帳戶號碼。",
      "將這些資訊複製到 Octomiser 中對應的欄位。",
      "您可能需要在不同的視窗或分頁間切換，以取得所有必要資訊。",
      "我們不會自動從您的 Octopus Energy 帳戶擷取這些資料，因為那樣做會違反其服務條款。"
    ],
    "zh-Hans": [
      "使用上方提供的链接登录您的 Octopus Energy 账户。",
      "登录后，在“API 访问”部分查看您的 API 密钥和账户号。",
      "将这些信息复制到 Octomiser 中对应的字段。",
      "您可能需要在不同的窗口或标签页之间切换，以收集所有必要的信息。",
      "我们不会自动从您的 Octopus Energy 账户获取这些信息，因为那样做会违反其服务条款。"
    ],
    "es": [
      "Inicie sesión en su cuenta de Octopus Energy utilizando los enlaces proporcionados.",
      "Una vez dentro, localice su Clave API y Número de Cuenta en la sección 'acceso API'.",
      "Copie estos datos en los campos correspondientes dentro de Octomiser.",
      "Puede que necesite cambiar de ventana o pestaña para reunir toda la información necesaria.",
      "No extraemos automáticamente estos datos de su cuenta de Octopus Energy, ya que hacerlo infringiría sus términos de servicio."
    ],
    "fr": [
      "Connectez-vous à votre compte Octopus Energy en utilisant les liens fournis.",
      "Une fois connecté, repérez votre Clé API et votre Numéro de Compte dans la section « accès API ».",
      "Copiez ces informations dans les champs correspondants au sein d’Octomiser.",
      "Vous devrez peut-être basculer entre plusieurs fenêtres ou onglets pour rassembler toutes les informations nécessaires.",
      "Nous ne récupérons pas automatiquement ces informations depuis votre compte Octopus Energy, car cela enfreindrait leurs conditions d’utilisation."
    ],
    "de": [
      "Melden Sie sich über die bereitgestellten Links bei Ihrem Octopus Energy-Konto an.",
      "Sobald Sie angemeldet sind, finden Sie Ihren API-Schlüssel und Ihre Kontonummer im Bereich „API-Zugriff“.",
      "Kopieren Sie diese Informationen in die entsprechenden Felder in Octomiser.",
      "Möglicherweise müssen Sie zwischen Fenstern oder Tabs wechseln, um alle erforderlichen Informationen zu sammeln.",
      "Wir rufen diese Informationen nicht automatisch aus Ihrem Octopus Energy-Konto ab, da dies gegen deren Nutzungsbedingungen verstoßen würde."
    ],
    "it": [
      "Acceda al suo account Octopus Energy tramite i link forniti.",
      "Una volta effettuato l’accesso, individui la Chiave API e il Numero di Account nella sezione 'accesso API'.",
      "Copi questi dati nei campi corrispondenti all’interno di Octomiser.",
      "Potrebbe essere necessario passare da una finestra o scheda all’altra per recuperare tutte le informazioni richieste.",
      "Non estraiamo automaticamente questi dati dal suo account Octopus Energy, poiché ciò violerebbe i relativi termini di servizio."
    ],
    "ja": [
      "提供されたリンクを使用して Octopus Energy アカウントにサインインしてください。",
      "サインイン後、「APIアクセス」セクションで APIキー と アカウント番号 を確認します。",
      "これらの情報を Octomiser の対応するフィールドにコピーしてください。",
      "すべての必要情報を収集するために、ウィンドウやタブを切り替える必要がある場合があります。",
      "Octopus Energy アカウントからこれらの情報を自動的に取得することは、利用規約に反するため行っておりません。"
    ],
    "ko": [
      "제공된 링크를 통해 Octopus Energy 계정에 로그인하세요.",
      "로그인 후 'API 액세스' 섹션에서 API 키와 계정 번호를 확인하세요.",
      "이 정보를 Octomiser의 해당 필드에 복사해 주세요.",
      "필요한 모든 정보를 모으려면 창이나 탭을 전환해야 할 수도 있습니다.",
      "Octopus Energy 계정에서 이 정보를 자동으로 가져오지 않는 이유는, 이는 해당 서비스 약관에 위배되기 때문입니다."
    ],
    "pt-PT": [
      "Inicie sessão na sua conta Octopus Energy através dos links fornecidos.",
      "Depois de iniciar sessão, localize a Chave API e o Número de Conta na secção ‘acesso API’.",
      "Copie estas informações para os campos correspondentes no Octomiser.",
      "Poderá ter de alternar entre janelas ou separadores para reunir todas as informações necessárias.",
      "Não obtemos automaticamente estes dados da sua conta Octopus Energy, pois isso infringiria os termos de serviço."
    ],
    "nl": [
      "Log in op uw Octopus Energy-account via de verstrekte links.",
      "Zoek na het inloggen uw API-sleutel en accountnummer op in de sectie ‘API-toegang’.",
      "Kopieer deze gegevens in de juiste velden binnen Octomiser.",
      "Mogelijk moet u tussen vensters of tabbladen schakelen om alle benodigde informatie te verzamelen.",
      "Wij halen deze gegevens niet automatisch uit uw Octopus Energy-account, omdat dit in strijd zou zijn met hun servicevoorwaarden."
    ],
    "pl": [
      "Zaloguj się do swojego konta Octopus Energy, korzystając z udostępnionych linków.",
      "Po zalogowaniu przejdź do sekcji „dostęp API”, aby znaleźć swój Klucz API i Numer Konta.",
      "Skopiuj te informacje do odpowiednich pól w Octomiser.",
      "Być może będziesz musiał przełączać się między oknami lub kartami, aby zebrać wszystkie niezbędne dane.",
      "Nie pobieramy tych informacji automatycznie z Twojego konta Octopus Energy, ponieważ naruszałoby to ich warunki świadczenia usług."
    ],
    "ru": [
      "Войдите в свою учетную запись Octopus Energy, воспользовавшись предоставленными ссылками.",
      "После входа найдите свой API-ключ и номер счета в разделе «доступ к API».",
      "Скопируйте эти данные в соответствующие поля в Octomiser.",
      "Возможно, вам придется переключаться между окнами или вкладками, чтобы собрать всю необходимую информацию.",
      "Мы не загружаем эти данные автоматически из вашей учетной записи Octopus Energy, так как это нарушало бы их условия обслуживания."
    ],
    "tr": [
      "Sağlanan bağlantıları kullanarak Octopus Energy hesabınıza giriş yapın.",
      "Giriş yaptıktan sonra 'API erişimi' bölümünde API Anahtarınızı ve Hesap Numaranızı bulun.",
      "Bu bilgileri Octomiser içindeki ilgili alanlara kopyalayın.",
      "Gerekli tüm verileri toplamak için pencereler veya sekmeler arasında geçiş yapmanız gerekebilir.",
      "Octopus Energy hesabınızdaki bu bilgileri otomatik olarak getirmiyoruz, çünkü bu, hizmet şartlarını ihlal eder."
    ],
    "ar": [
      "سجّل الدخول إلى حساب Octopus Energy الخاص بك باستخدام الروابط المتوفرة.",
      "بعد تسجيل الدخول، ابحث عن مفتاح API ورقم الحساب في قسم «الوصول إلى API».",
      "انسخ هذه التفاصيل يدويًا إلى الحقول ذات الصلة في Octomiser.",
      "قد تحتاج إلى التنقل بين النوافذ أو علامات التبويب لجمع جميع المعلومات الضرورية.",
      "لا نُحضر هذه التفاصيل تلقائيًا من حساب Octopus Energy الخاص بك، لأن ذلك سينتهك شروط الخدمة الخاصة بهم."
    ],
    "cs": [
      "Přihlaste se ke svému účtu Octopus Energy pomocí poskytnutých odkazů.",
      "Po přihlášení vyhledejte svůj API klíč a číslo účtu v sekci „přístup k API“.",
      "Zkopírujte tyto údaje do příslušných polí v aplikaci Octomiser.",
      "Může být nutné přepínat mezi okny nebo kartami pro shromáždění všech potřebných informací.",
      "Tyto údaje automaticky nestahujeme z vašeho účtu Octopus Energy, protože by to porušovalo jejich podmínky služby."
    ],
    "da": [
      "Log ind på din Octopus Energy-konto ved hjælp af de angivne links.",
      "Når du er logget ind, kan du finde din API-nøgle og dit kontonummer under 'API-adgang'.",
      "Kopier disse oplysninger til de tilsvarende felter i Octomiser.",
      "Du skal muligvis skifte mellem vinduer eller faner for at indsamle alle nødvendige informationer.",
      "Vi henter ikke disse oplysninger automatisk fra din Octopus Energy-konto, da det ville bryde deres servicevilkår."
    ],
    "fi": [
      "Kirjaudu sisään Octopus Energy -tilillesi käyttämällä annettuja linkkejä.",
      "Sisäänkirjautumisen jälkeen etsi API-avaimesi ja tilinumerosi 'API-käyttöoikeus'-osiosta.",
      "Kopioi nämä tiedot Octomiserin vastaaviin kenttiin.",
      "Tarvitsemasi tiedot saatat joutua keräämään eri ikkunoita tai välilehtiä vaihtelemalla.",
      "Emme hae näitä tietoja automaattisesti Octopus Energy -tililtäsi, sillä se rikkoisi heidän käyttöehtojaan."
    ],
    "el": [
      "Συνδεθείτε στον λογαριασμό σας στο Octopus Energy χρησιμοποιώντας τους παρεχόμενους συνδέσμους.",
      "Αφού συνδεθείτε, εντοπίστε το Κλειδί API και τον Αριθμό Λογαριασμού στην ενότητα «πρόσβαση API».",
      "Αντιγράψτε αυτά τα στοιχεία στα αντίστοιχα πεδία στο Octomiser.",
      "Ίσως χρειαστεί να εναλλάσσεστε μεταξύ παραθύρων ή καρτελών για να συγκεντρώσετε όλες τις απαραίτητες πληροφορίες.",
      "Δεν ανακτούμε αυτόματα αυτά τα στοιχεία από τον λογαριασμό σας στο Octopus Energy, καθώς κάτι τέτοιο θα παραβίαζε τους όρους υπηρεσίας τους."
    ],
    "he": [
      "היכנס לחשבון Octopus Energy שלך באמצעות הקישורים שסופקו.",
      "לאחר הכניסה, אתר את מפתח ה-API ואת מספר החשבון שלך באזור 'גישה ל-API'.",
      "העתק ידנית את הפרטים לשדות המתאימים ב-Octomiser.",
      "ייתכן שתצטרך לעבור בין חלונות או כרטיסיות כדי לאסוף את כל המידע הנחוץ.",
      "איננו מאתרים פרטים אלו אוטומטית מחשבון Octopus Energy שלך, שכן פעולה זו תהיה הפרה של תנאי השירות שלהם."
    ],
    "hi": [
      "प्रदान किए गए लिंक का उपयोग करके अपने Octopus Energy खाते में साइन इन करें।",
      "साइन इन करने के बाद, 'API एक्सेस' सेक्शन में अपनी API कुंजी और खाता संख्या ढूंढें।",
      "इन विवरणों को Octomiser के संबंधित फ़ील्ड में कॉपी करें।",
      "सभी आवश्यक जानकारी इकट्ठा करने के लिए आपको विंडो या टैब के बीच स्विच करना पड़ सकता है।",
      "हम आपके Octopus Energy खाते से ये विवरण स्वचालित रूप से एकत्रित नहीं करते हैं, क्योंकि ऐसा करना उनकी सेवा शर्तों का उल्लंघन होगा।"
    ],
    "hu": [
      "A megadott linkek segítségével jelentkezzen be Octopus Energy-fiókjába.",
      "Bejelentkezés után keresse meg az API kulcsot és a számlaszámot az „API hozzáférés” szakaszban.",
      "Másolja át ezeket az adatokat az Octomiser megfelelő mezőibe.",
      "Előfordulhat, hogy ablakok vagy fülek között kell váltania az összes szükséges információ összegyűjtéséhez.",
      "Nem töltjük le automatikusan ezeket az adatokat az Octopus Energy-fiókjából, mert ez sértené a szolgáltatási feltételeiket."
    ],
    "id": [
      "Masuk ke akun Octopus Energy Anda menggunakan tautan yang disediakan.",
      "Setelah masuk, temukan Kunci API dan Nomor Akun di bagian 'akses API'.",
      "Salin detail ini secara manual ke kolom yang sesuai di Octomiser.",
      "Anda mungkin perlu beralih antara jendela atau tab untuk mengumpulkan semua informasi yang diperlukan.",
      "Kami tidak secara otomatis mengambil detail ini dari akun Octopus Energy Anda karena tindakan tersebut akan melanggar ketentuan layanan mereka."
    ],
    "nb": [
      "Logg inn på Octopus Energy-kontoen din ved hjelp av de gitte lenkene.",
      "Når du er logget inn, finn API-nøkkelen og kontonummeret ditt i «API-tilgang»-delen.",
      "Kopier disse detaljene manuelt inn i de aktuelle feltene i Octomiser.",
      "Du må kanskje bytte mellom vinduer eller faner for å samle all nødvendig informasjon.",
      "Vi henter ikke automatisk inn disse detaljene fra Octopus Energy-kontoen din, da det ville bryte deres tjenestevilkår."
    ],
    "ro": [
      "Conectați-vă la contul dvs. Octopus Energy utilizând linkurile furnizate.",
      "După ce v-ați conectat, localizați Cheia API și Numărul de Cont în secțiunea «acces API».",
      "Copiați manual aceste informații în câmpurile corespunzătoare din Octomiser.",
      "Este posibil să fie necesar să comutați între ferestre sau file pentru a aduna toate informațiile necesare.",
      "Nu preluăm automat aceste detalii din contul dvs. Octopus Energy, deoarece acest lucru ar încălca termenii lor de serviciu."
    ],
    "sk": [
      "Prihláste sa do svojho účtu Octopus Energy pomocou poskytnutých odkazov.",
      "Po prihlášení vyhľadajte svoj API kľúč a číslo účtu v sekcii „prístup k API“.",
      "Tieto údaje ručne skopírujte do príslušných polí v aplikácii Octomiser.",
      "Môže byť potrebné prepínať medzi oknami alebo kartami, aby ste zhromaždili všetky požadované informácie.",
      "Tieto údaje automaticky nevyberáme z vášho účtu Octopus Energy, pretože by to porušovalo ich podmienky poskytovania služieb."
    ],
    "sv": [
      "Logga in på ditt Octopus Energy-konto med hjälp av de angivna länkarna.",
      "När du är inloggad, leta reda på din API-nyckel och ditt kontonummer under avsnittet 'API-åtkomst'.",
      "Kopiera dessa uppgifter manuellt till motsvarande fält i Octomiser.",
      "Du kan behöva växla mellan olika fönster eller flikar för att samla all nödvändig information.",
      "Vi hämtar inte dessa uppgifter automatiskt från ditt Octopus Energy-konto, eftersom det skulle bryta mot deras användarvillkor."
    ],
    "th": [
      "ลงชื่อเข้าใช้บัญชี Octopus Energy ของคุณโดยใช้ลิงก์ที่ให้ไว้",
      "เมื่อลงชื่อเข้าใช้แล้ว ให้ค้นหา API Key และหมายเลขบัญชีในส่วน 'API Access'",
      "คัดลอกรายละเอียดเหล่านี้ไปยังฟิลด์ที่เหมาะสมใน Octomiser ด้วยตนเอง",
      "คุณอาจต้องสลับหน้าต่างหรือแท็บเพื่อรวบรวมข้อมูลทั้งหมดที่ต้องใช้",
      "เราไม่ดึงข้อมูลเหล่านี้จากบัญชี Octopus Energy ของคุณโดยอัตโนมัติ เพราะจะเป็นการละเมิดเงื่อนไขการให้บริการ"
    ],
    "uk": [
      "Увійдіть до свого облікового запису Octopus Energy, скориставшись наданими посиланнями.",
      "Після входу знайдіть свій API-ключ і номер рахунку в розділі «доступ до API».",
      "Скопіюйте ці дані вручну у відповідні поля в Octomiser.",
      "Можливо, вам доведеться перемикатися між різними вікнами чи вкладками, щоб зібрати всю необхідну інформацію.",
      "Ми не отримуємо ці дані автоматично з вашого облікового запису Octopus Energy, оскільки це порушило б умови їхньої угоди."
    ],
    "vi": [
      "Đăng nhập vào tài khoản Octopus Energy của bạn bằng các liên kết được cung cấp.",
      "Sau khi đăng nhập, tìm Khóa API và Số Tài khoản trong phần 'truy cập API'.",
      "Sao chép những thông tin này một cách thủ công vào các trường tương ứng trong Octomiser.",
      "Bạn có thể cần chuyển đổi giữa các cửa sổ hoặc tab để thu thập đầy đủ thông tin cần thiết.",
      "Chúng tôi không tự động lấy những chi tiết này từ tài khoản Octopus Energy của bạn vì việc đó sẽ vi phạm điều khoản dịch vụ của họ."
    ]
  }
}
