{
    "tldr": {
        "en": "By using Octomiser, you agree to these terms. The app helps you monitor Octopus Energy rates and usage. We respect your privacy and don't collect personal data. Your API key and account details are stored only on your device and in your private iCloud account.",
        "zh-Hant": "使用Octomiser即表示您同意這些條款。該應用程式幫助您監控Octopus Energy費率和使用情況。我們尊重您的隱私，不收集個人數據。您的API密鑰和帳戶詳細信息僅存儲在您的設備和私人iCloud帳戶中。",
        "zh-Hans": "使用Octomiser即表示您同意这些条款。该应用程序帮助您监控Octopus Energy费率和使用情况。我们尊重您的隐私，不收集个人数据。您的API密钥和账户详细信息仅存储在您的设备和私人iCloud账户中。"
    },
    "title": "Terms and Conditions",
    "introduction": "Welcome to Octomiser. By downloading or using the app, you agree to these terms which will be legally binding. Please read them carefully before using the app.",
    "sections": [
        {
            "heading": "1. Acceptance of Terms",
            "body": [
                "By accessing and using Octomiser, you acknowledge that you have read, understood, and agree to be bound by these Terms.",
                "If you do not agree with any part of these terms, you must not use the app."
            ]
        },
        {
            "heading": "2. App Usage",
            "body": [
                "Octomiser is designed to help you monitor and analyze your Octopus Energy usage and rates.",
                "The app requires your Octopus Energy API key and account details to access your energy data.",
                "You are responsible for maintaining the confidentiality of your API key and account information.",
                "You agree to use the app only for its intended purpose and in compliance with all applicable laws."
            ]
        },
        {
            "heading": "3. Data and Privacy",
            "body": [
                "We do not collect or store any personal data on our servers.",
                "Your API key and account details are stored exclusively on your device and in your private iCloud account.",
                "You maintain full control over your data and can delete it at any time.",
                "By using the app, you grant Octopus Energy permission to share your energy data with the app."
            ]
        },
        {
            "heading": "4. Intellectual Property",
            "body": [
                "The app, including its original content, features, and functionality, is owned by Eugnel and protected by international copyright, trademark, and other intellectual property laws.",
                "You may not modify, reproduce, distribute, or create derivative works based on any portion of the app without explicit permission."
            ]
        },
        {
            "heading": "5. Disclaimer of Warranties",
            "body": [
                "The app is provided 'as is' and 'as available' without any warranties of any kind.",
                "We do not guarantee that the app will be uninterrupted, timely, secure, or error-free.",
                "Any reliance you place on the information provided by the app is strictly at your own risk."
            ]
        },
        {
            "heading": "6. Limitation of Liability",
            "body": [
                "To the maximum extent permitted by law, we shall not be liable for any indirect, incidental, special, consequential, or punitive damages resulting from your use of the app.",
                "This includes, but is not limited to, loss of data, profits, or business opportunities."
            ]
        },
        {
            "heading": "7. Changes to Terms",
            "body": [
                "We reserve the right to modify these terms at any time.",
                "Continued use of the app after any changes constitutes acceptance of the new terms.",
                "It is your responsibility to review these terms periodically."
            ]
        },
        {
            "heading": "8. Termination",
            "body": [
                "We reserve the right to terminate or suspend your access to the app at any time, without prior notice, for any reason.",
                "Upon termination, all provisions of these terms which should survive termination shall remain in effect."
            ]
        },
        {
            "heading": "9. Contact",
            "body": [
                "If you have any questions about these Terms, please contact us at octomiser@eugnel.com."
            ]
        }
    ]
} 